<template>
	<div class="container">
		<Header />
		<ListTerms 
			:listTerms="terms"
		/>
		<Footer />
	</div>
</template>

<script>
import Header from '../Header.vue';
import Footer from '../Footer.vue';
import ListTerms from '../ListTerms.vue';
export default {
    components: { Header, Footer, ListTerms },
		data(){
			return {
				terms: [
					{title: 'Условия сервиса',
						text: 'Задача организации, в особенности же курс на социально-ориентированный национальный проект требует от нас системного анализа модели развития! Таким образом, постоянное информационно-техническое обеспечение нашей деятельности требует от нас анализа системы масштабного изменения ряда параметров! С другой стороны социально-экономическое развитие напрямую зависит от всесторонне сбалансированных нововведений?',
						id: 1,
					},
					{
						title: 'Условия сервиса',
						text: 'Задача организации, в особенности же курс на социально-ориентированный национальный проект требует от нас системного анализа модели развития! Таким образом, постоянное информационно-техническое обеспечение нашей деятельности требует от нас анализа системы масштабного изменения ряда параметров! С другой стороны социально-экономическое развитие напрямую зависит от всесторонне сбалансированных нововведений?',
						id: 2,
					},
					{
						title: 'Условия сервиса',
						text: 'Задача организации, в особенности же курс на социально-ориентированный национальный проект требует от нас системного анализа модели развития! Таким образом, постоянное информационно-техническое обеспечение нашей деятельности требует от нас анализа системы масштабного изменения ряда параметров! С другой стороны социально-экономическое развитие напрямую зависит от всесторонне сбалансированных нововведений?',
						id: 3,
					}
				]
			}
		}
}
</script>

<style>

</style>